/* ========================================================================================================
1. В базе данных Redis подберите коллекцию для подсчета посещений с определенных IP-адресов.
======================================================================================================== */

127.0.0.1:6379> HSET ipaddr 127.0.0.1 2
(integer) 2

127.0.0.1:6379> HSET ipaddr 127.0.0.2 1
(integer) 1

127.0.0.1:6379> HGET ipaddr 127.0.0.1
"1"

127.0.0.1:6379> HINCRBY ipaddr 127.0.0.1 1
(integer) 3

127.0.0.1:6379> HGET ipaddr 127.0.0.1
"3"

127.0.0.1:6379> HGETALL ipaddr
1) "127.0.0.1"
2) "3"
3) "127.0.0.2"
4) "1"

/* ========================================================================================================
2. При помощи базы данных Redis решите задачу поиска имени пользователя по электронному адресу и наоборот,
поиск электронного адреса пользователя по его имени.
======================================================================================================== */

127.0.0.1:6379> SADD users "x@x.com|user1" "y@y.com|user2" "z@z.com|user3"
(integer) 3

127.0.0.1:6379> SSCAN users 0 MATCH "*user3*"
1) "0"
2) 1) "z@z.com|user3"

127.0.0.1:6379> SSCAN users 0 MATCH "*z@z.com*"
1) "0"
2) 1) "z@z.com|user3"


/* ========================================================================================================
3. Организуйте хранение категорий и товарных позиций учебной базы данных shop в СУБД MongoDB.
======================================================================================================== */

> db.shop.insert({catalog: 'Процессоры', name: 'Intel Core i3-8100', description: 'Процессор для настольных персональных компьютеров, основанных на платформе Intel.', price: 7890.00})
WriteResult({ "nInserted" : 1 })
> db.shop.insert({catalog: 'Процессоры', name: 'AMD FX-8320E', description: 'Процессор для настольных персональных компьютеров, основанных на платформе AMD.', price: 4780.00})
WriteResult({ "nInserted" : 1 })

> db.shop.find({ name: 'Intel Core i3-8100' })
{ "_id" : ObjectId("5ce5abb0b1008c989934fca5"), "catalog" : "Процессоры", "name" : "Intel Core i3-8100", "description" : "Процессор для настольных персональных компьютеров, основанных на платформе Intel.", "price" : 7890 }
